### How to select a pandas series from a DataFrame?

In [32]:
import pandas as pd

In [33]:
data = pd.read_csv('http://bit.ly/uforeports', sep=',')

In [34]:
type(data)

pandas.core.frame.DataFrame

In [35]:
# head() is a built-in function with shows the first five rows of the dataset
data.head()

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

#### There are two ways to slice datasets. 
- Bracket notation
- Dot notation

In [36]:
# Bracket notation and showing the first five rows
data['City'].head()

0                  Ithaca
1             Willingboro
2                 Holyoke
3                 Abilene
4    New York Worlds Fair
Name: City, dtype: object

Data type of City is a pandas series. When slicing a column/feature from a pandas datafram, it's always panda series data type

In [37]:
type(data['City'])

pandas.core.series.Series

In [38]:
# Dot notation
data.City.head()

0                  Ithaca
1             Willingboro
2                 Holyoke
3                 Abilene
4    New York Worlds Fair
Name: City, dtype: object

When using dot notation to slice any dataframe, it's important to know that the column name doesn't have any white space between the words. Otherewise, it wouldn't work like example below.

In [39]:
# Dot notation wouldn't work with column's name with space seperation
data.Colors Reported.head()

SyntaxError: invalid syntax (<ipython-input-39-1c7d38e84f13>, line 2)

The only way to select 'Colors Reprted' column from the dataframe is using bracket notation.

In [40]:
data['Colors Reported'].head()

0    NaN
1    NaN
2    NaN
3    NaN
4    NaN
Name: Colors Reported, dtype: object

To know the shape of the dataframe, one can easily use 'shape' built-in function. the shape of our data consists of 18241 rows and 5 columns

In [41]:
data.shape

(18241, 5)

One can easily add two columns or more from a dataframe.

In [43]:
data.City + ', ' + data.State

0                      Ithaca, NY
1                 Willingboro, NJ
2                     Holyoke, CO
3                     Abilene, KS
4        New York Worlds Fair, NY
5                 Valley City, ND
6                 Crater Lake, CA
7                        Alma, MI
8                     Eklutna, AK
9                     Hubbard, OR
10                    Fontana, CA
11                   Waterloo, AL
12                     Belton, SC
13                     Keokuk, IA
14                  Ludington, MI
15                Forest Home, CA
16                Los Angeles, CA
17                  Hapeville, GA
18                     Oneida, TN
19                 Bering Sea, AK
20                   Nebraska, NE
21                            NaN
22                            NaN
23                  Owensboro, KY
24                 Wilderness, WV
25                  San Diego, CA
26                 Wilderness, WV
27                     Clovis, NM
28                 Los Alamos, NM
29               Ft. Duschene, UT
                   ...
18211                 Holyoke, MA
18212                  Carson, CA
18213                Pasadena, CA
18214                  Austin, TX
18215                El Campo, TX
18216            Garden Grove, CA
18217           Berthoud Pass, CO
18218              Sisterdale, TX
18219            Garden Grove, CA
18220             Shasta Lake, CA
18221                Franklin, NH
18222          Albrightsville, PA
18223              Greenville, SC
18224                 Eufaula, OK
18225             Simi Valley, CA
18226           San Francisco, CA
18227           San Francisco, CA
18228              Kingsville, TX
18229                 Chicago, IL
18230             Pismo Beach, CA
18231             Pismo Beach, CA
18232                    Lodi, WI
18233               Anchorage, AK
18234                Capitola, CA
18235          Fountain Hills, AZ
18236              Grant Park, IL
18237             Spirit Lake, IA
18238             Eagle River, WI
18239             Eagle River, WI
18240                    Ybor, FL
dtype: object

When creating/adding a new pandas series into a DataFrame, we hould always use bracket notaion

In [44]:
data['location'] = data.City + ', ' + data.State

In [45]:
data.head()

,City,Colors Reported,Shape Reported,State,Time,location
0,Ithaca,NaN,TRIANGLE,NY,6/1/1930 22:00,"Ithaca, NY"
1,Willingboro,NaN,OTHER,NJ,6/30/1930 20:00,"Willingboro, NJ"
2,Holyoke,NaN,OVAL,CO,2/15/1931 14:00,"Holyoke, CO"
3,Abilene,NaN,DISK,KS,6/1/1931 13:00,"Abilene, KS"
4,New York Worlds Fair,NaN,LIGHT,NY,4/18/1933 19:00,"New York Worlds Fair, NY"